{
 "results": [
    {
      "adult": false,
      "backdrop_path": "/yFuKvT4Vm3sKHdFY4eG6I4ldAnn.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 1771,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Captain America: The First Avenger",
      "overview": "Seorang pemuda sakit-sakitan yang berusaha untuk mendaftarkan diri di Angkatan Darat Amerika Serikat pada tahun 1943 untuk melawan Nazi, tetapi dianggap tidak layak secara fisik. Kemudian dia justru menawarkan diri untuk menjadi relawan dalam sebuah proyek yang disebut Rebirth, sebuah operasi militer rahasia untuk membantu upaya perang Amerika Serikat yang menggunakan serum tertentu untuk mengubah Steve Rogers ke puncak kesempurnaan manusia dan menjadi tentara super.",
      "popularity": 99.907,
      "poster_path": "/vSNxAJTlD0r02V9sPYpOjqDZXUK.jpg",
      "release_date": "2011-07-22",
      "title": "Kapten Amerika: Avenger Pertama",
      "video": false,
      "vote_average": 7,
      "vote_count": 16670
    },
    {
      "adult": false,
      "backdrop_path": "/cDJ61O1STtbWNBwefuqVrRe3d7l.jpg",
      "genres": "Action, Adventure",
      "id": 10195,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Thor",
      "overview": "Melawan kehedak Ayahnya Odin, Sang Perkasa Thor – Dewa pejuang yang kuat namun sombong – dengan ceroboh menyalakan kembali perang kuno. Thor dibuang ke Bumi dan dipaksa untuk hidup di antara manusia sebagai hukuman. Begitu tiba di sini, Thor belajar apa yang diperlukan untuk menjadi pahlawan sejati ketika penjahat paling berbahaya di dunianya mengirimkan pasukan tergelap Asgard untuk menyerang Bumi.",
      "popularity": 82.408,
      "poster_path": "/jWnbuXuzMIl3FDIs0qY9ZdDPxCl.jpg",
      "release_date": "2011-04-21",
      "title": "Thor",
      "video": false,
      "vote_average": 6.8,
      "vote_count": 16390
    },
    {
      "adult": false,
      "backdrop_path": "/xYz4u1jWCKyXGzddMJeOL845DTr.jpg",
      "genres": "Action, Adventure, Fantasy",
      "id": 1930,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "The Amazing Spider-Man",
      "overview": "Peter Parker adalah siswa sekolah menengah yang terbuang yang ditinggalkan oleh orang tuanya saat masih kecil, meninggalkannya untuk dibesarkan oleh Paman Ben dan Bibi May. Seperti kebanyakan remaja, Peter mencoba mencari tahu siapa dia dan bagaimana dia bisa menjadi seperti sekarang ini. Saat Peter menemukan tas misterius milik ayahnya, dia memulai pencarian untuk memahami hilangnya orang tuanya - membawanya langsung ke Oscorp dan lab Dr. Curt Connors, mantan rekan ayahnya. Saat Spider-Man berada pada jalur yang bertabrakan dengan alter ego Connors, The Lizard, Peter akan membuat pilihan yang mengubah hidup untuk menggunakan kekuatannya dan membentuk takdirnya untuk menjadi pahlawan.",
      "popularity": 69.921,
      "poster_path": "/dQ8TOCYgP9pzQvSb1cmaalYqdb5.jpg",
      "release_date": "2012-06-23",
      "title": "The Amazing Spider-Man",
      "video": false,
      "vote_average": 6.6,
      "vote_count": 12801
    },
    {
      "adult": false,
      "backdrop_path": "/rF3kAqk08zGSvs8m6hRwsi28nHg.jpg",
      "genres": "Action, Adventure, Fantasy",
      "id": 102382,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "The Amazing Spider-Man 2",
      "overview": "Bagi Peter Parker, hidup itu sibuk. Antara mengambil orang jahat sebagai Spider-Man dan menghabiskan waktu bersama orang yang dia cintai, Gwen Stacy, kelulusan sekolah menengah tidak bisa datang cukup cepat. Peter tidak melupakan janji yang dia buat kepada ayah Gwen untuk melindunginya dengan menjauh, tapi itu adalah janji yang tidak bisa dia tepati. Hal-hal akan berubah untuk Peter ketika penjahat baru, Electro, muncul, seorang teman lama, Harry Osborn, kembali, dan Peter menemukan petunjuk baru tentang masa lalunya.",
      "popularity": 73.488,
      "poster_path": "/h4NC0pkqvDX7Q6TI3PyW4NJKEYi.jpg",
      "release_date": "2014-04-16",
      "title": "The Amazing Spider-Man 2",
      "video": false,
      "vote_average": 6.4,
      "vote_count": 9267
    },
    {
      "adult": false,
      "backdrop_path": "/7AyEEZVtFjNMCOEoz88pBqiAI8n.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 102899,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Ant-Man",
      "overview": "Dipersenjatai dengan kemampuan menakjubkan untuk menyusut dalam skala tetapi meningkatkan kekuatan, pencuri ulung Scott Lang harus merangkul pahlawan batinnya dan membantu mentornya, Dokter Hank Pym, melindungi rahasia di balik pakaian Ant-Man spektakuler dari generasi baru ancaman yang menjulang tinggi. . Menghadapi rintangan yang tampaknya tidak dapat diatasi, Pym dan Lang harus merencanakan dan melakukan pencurian yang akan menyelamatkan dunia.",
      "popularity": 62.227,
      "poster_path": "/rQRnQfUl3kfp78nCWq8Ks04vnq1.jpg",
      "release_date": "2015-07-14",
      "title": "Ant-Man",
      "video": false,
      "vote_average": 7.1,
      "vote_count": 15422
    },
    {
      "adult": false,
      "backdrop_path": "/nNmJRkg8wWnRmzQDe2FwKbPIsJV.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 24428,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "The Avengers",
      "overview": "Ketika musuh yang tak terduga muncul, mengancam keselamatan dan keamanan dunia, Nick Fury, direktur Badan Perdamaian Internasional, dikenal sebagai S.H.I.E.L.D. , membutuhkan tim untuk menyelamatkan dunia dari bencana. Usaha perekrutan pun dimulai  Iron Man, Captain America, Hulk, Thor, Black Widow dan Hawkeye dikumpulkan untuk menaklukkan Dewa Kehancuran, Loki, dalam usahanya menghancurkan bumi. Dengan semua gabungan kekuatan, tugas nampak lebih mudah. Namun kenyatannya tidak demikian!  Para pahlawan super justru saling melawan satu sama lain  Hulk melawan Captain America, siapa yang akan menang? Apakah Iron Man dapat mengalahkan kekuatan super milik Thor? Bagaimana para pahlawan super ini secara bersama-sama menghadapi bencana, melindungi masyarakat dan yang terpenting, bertahan hidup?",
      "popularity": 177.46,
      "poster_path": "/RYMX2wcKCBAr24UyPD7xwmjaTn.jpg",
      "release_date": "2012-04-25",
      "title": "The Avengers",
      "video": false,
      "vote_average": 7.7,
      "vote_count": 24541
    },
    {
      "adult": false,
      "backdrop_path": "/xnqust9Li4oxfhXD5kcPi3UC8i4.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 99861,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Avengers: Age of Ultron",
      "overview": "Saat Tony Stark (Robert Downey Jr) memutuskan untuk membuat program perdamaian. Tony menciptakan robot cerdas Ultron untuk menggantikan peran Iron Man, Captain America, Thor, The Incredible Hulk, Black Widow dan Hawkeye. Tapi Ternyata Ultron mampu berfikir dan memiliki niat jahat yang sangat mengerikan.  Ultron kini menjadi musuh bersama tim Avengers. Tidak mudah bagi tim untuk membasmi Ultron disaat mereka terancam tercerai berai karena berbeda pendapat. Tim Avengers harus bisa menghentikan rencana jahat Ultron dan membangun kekuatan bersama untuk menyelamatkan bumi dari kehancuran.",
      "popularity": 147.473,
      "poster_path": "/dsZUpJ6ml5dQpI7vBdscveCv4aB.jpg",
      "release_date": "2015-04-22",
      "title": "Avengers: Age of Ultron",
      "video": false,
      "vote_average": 7.3,
      "vote_count": 17775
    },
    {
      "adult": false,
      "backdrop_path": "/hZnnUq0mrUQ3e54SJVca4mf2oAQ.jpg",
      "genres": "Action, Adventure",
      "id": 36647,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Blade",
      "overview": "Daywalker yang dikenal sebagai \"Blade\" - manusia setengah vampir, setengah manusia - menjadi pelindung umat manusia dari pasukan vampir bawah tanah.",
      "popularity": 28.93,
      "poster_path": "/e6ErRnIgKmoBtcKpht3amsMfo52.jpg",
      "release_date": "1998-08-21",
      "title": "Blade",
      "video": false,
      "vote_average": 6.7,
      "vote_count": 4270
    },
    {
      "adult": false,
      "backdrop_path": "/g8cjJHZFeZQ5GRbFiDp5jXgfOZW.jpg",
      "genres": "Action, Adventure",
      "id": 36586,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Blade II",
      "overview": "Mutasi langka telah terjadi dalam komunitas vampir - The Reaper. Seorang vampir yang sangat haus darah yang tak terpuaskan sehingga mereka memangsa vampir serta manusia, mengubah korban yang tidak cukup beruntung untuk bertahan hidup menjadi Reapers sendiri. Blade diminta oleh Bangsa Vampir atas bantuannya dalam mencegah wabah mimpi buruk yang akan melenyapkan manusia dan vampir.",
      "popularity": 34.374,
      "poster_path": "/vulF0iqX5z7AW1pdZ572zwsMRMB.jpg",
      "release_date": "2002-03-22",
      "title": "Blade II",
      "video": false,
      "vote_average": 6.4,
      "vote_count": 3428
    },
    {
      "adult": false,
      "backdrop_path": "/y4VtmfWXaZBgnsaNcrW5hskPLUl.jpg",
      "genres": "Action, Adventure",
      "id": 36648,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Blade: Trinity",
      "overview": "Selama bertahun-tahun, Blade telah bertarung melawan vampir di malam hari. Tapi sekarang, setelah jatuh ke garis bidik FBI, dia dipaksa keluar ke siang hari, di mana dia didorong untuk bergabung dengan klan pemburu vampir manusia yang tidak pernah dia tahu ada - The Nightstalkers. Bersama dengan Abigail dan Hannibal, dua Nightstalker yang terlatih dengan cekatan, Blade mengikuti jejak darah ke makhluk purba yang juga memburunya - vampir asli, Dracula.",
      "popularity": 29.367,
      "poster_path": "/iQ2fyewqYDNmcUN18m8XbRGWgIM.jpg",
      "release_date": "2004-12-08",
      "title": "Blade: Trinity",
      "video": false,
      "vote_average": 5.9,
      "vote_count": 2834
    },
    {
      "adult": false,
      "backdrop_path": "/fHx9e35Vn7mMH3O0Fmfds70ABo8.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 13995,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Captain America",
      "overview": "Selama Perang Dunia II, seorang Prajurit Amerika yang pemberani dan patriotik menjalani eksperimen untuk menjadi prajurit super baru, \"Captain America\". Balapan ke Jerman untuk menyabotase roket dari baddie Nazi \"Tengkorak Merah\", Captain America akhirnya membeku hingga tahun 1990-an. Dia terbangun kembali untuk menemukan bahwa Tengkorak Merah telah mengubah identitas dan sekarang berencana untuk menculik Presiden Amerika Serikat.",
      "popularity": 41.055,
      "poster_path": "/bhN6oAvVjwiVEhKssM2yxo3cO8g.jpg",
      "release_date": "1990-12-14",
      "title": "Captain America",
      "video": false,
      "vote_average": 4.6,
      "vote_count": 281
    },
    {
      "adult": false,
      "backdrop_path": "/kvRT3GwcnqGHzPjXIVrVPhUix7Z.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 271110,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Captain America: Civil War",
      "overview": "Menyusul peristiwa Age of Ultron, pemerintah kolektif dunia mengeluarkan tindakan yang dirancang untuk mengatur semua aktivitas manusia super. Hal ini mempolarisasi opini para Avengers, menyebabkan dua faksi berpihak pada Iron Man atau Captain America, yang menyebabkan pertempuran epik antara mantan sekutu.",
      "popularity": 170.277,
      "poster_path": "/8xA9XQ6KfvXFKcNLNRWSPT39Gaz.jpg",
      "release_date": "2016-04-27",
      "title": "Captain America: Civil War",
      "video": false,
      "vote_average": 7.4,
      "vote_count": 17905
    },
    {
      "adult": false,
      "backdrop_path": "/yHB0eNR8rvCpn0VdghEwBsXAC0N.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 100402,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Captain America: The Winter Soldier",
      "overview": "Setelah peristiwa bencana di New York bersama The Avengers, Steve Rogers alias Captain America tinggal dengan tenang di Washington, D.C. dan mencoba menyesuaikan diri dengan dunia modern. Tapi ketika seorang S.H.I.E.L.D. kolega diserang, Steve terlibat dalam jaringan intrik yang mengancam untuk membahayakan dunia. Bergabung dengan Black Widow, Captain America berjuang untuk mengungkap konspirasi yang semakin meluas saat melawan pembunuh profesional yang dikirim untuk membungkamnya di setiap kesempatan. Ketika cakupan penuh dari plot jahat terungkap, Captain America dan Black Widow meminta bantuan sekutu baru, Falcon. Namun, mereka segera menemukan diri mereka menghadapi musuh yang tak terduga dan tangguh — Prajurit Musim Dingin.",
      "popularity": 96.58,
      "poster_path": "/5r1zWuzbsVAYSPzvCecAReGhN7k.jpg",
      "release_date": "2014-03-20",
      "title": "Captain America: The Winter Soldier",
      "video": false,
      "vote_average": 7.7,
      "vote_count": 14427
    },
    {
      "adult": false,
      "backdrop_path": "/e7jIX02GiSwsgkU5lMpeKjwq2Zc.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 9480,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Daredevil",
      "overview": "Seorang pria yang dibutakan dalam kecelakaan masa kanak-kanak melawan kejahatan menggunakan inderanya yang tersisa secara super-manusiawi.",
      "popularity": 32.232,
      "poster_path": "/oCDBwSkntYamuw8VJIxMRCtDBmi.jpg",
      "release_date": "2003-02-14",
      "title": "Daredevil",
      "video": false,
      "vote_average": 5.2,
      "vote_count": 3778
    },
    {
      "adult": false,
      "backdrop_path": "/en971MEXui9diirXlogOrPKmsEn.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 293660,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Deadpool",
      "overview": "Film action berjudul “Deadpool” ini merupakan film yang bercerita tentang seorang pria yang berprofesi sebagai tentara bayaran bernama Wade Wilson ( Ryan Reynolds ). Wade yang sedang mengalami sakit sekarat karena kanker dan mendapatkan sebuah tawaran untuk percobaan perubahan genetik di mana bisa mengubah dirinya dan menjadi seorang superhero. Karena penyakit yang dideritanya, Wade akhirnya memutuskan untuk melakukan percobaan tersebut. Percobaan tersebut akhirnya membuat diri Wade berubah drastis dan menjadi seorang superhero yang dijuluki dengan Deadpool.",
      "popularity": 105.14,
      "poster_path": "/8peYuPeLawgCFhuI4IcDjdrAAXw.jpg",
      "release_date": "2016-02-09",
      "title": "Deadpool",
      "video": false,
      "vote_average": 7.6,
      "vote_count": 24778
    },
    {
      "adult": false,
      "backdrop_path": "/aL53oMdZKZRJRH8txH07DLuleF9.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 284052,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Doctor Strange",
      "overview": "Hidup Stephen Vincent Strange (Benedict Cumberbatch), seorang doktor bedah yang pintar namun sombong, mendadak berubah drastis. Sebuah kecelakaan mobil membuat kemampuan tangannya menjadi sangat terbatas. Bertekad untuk menyembuhkan kondisinya, ia pun berpetualang mencari obat untuk memulihkan tangannya.  Perjalanan tersebut mempertemukan sang doktor bedah dengan penyihir bernama The Ancient One (Tilda Swinton), yang kemudian mengangkat Strange menjadi murid, dengan tujuan menjadikan ia sebagai pelindung alam manusia. Kali ini Strange harus mengesampingkan egonya, dan menggunakan segala kemampuannya untuk menjadi perantara antara dimensi manusia dan dimensi lain.",
      "popularity": 121.499,
      "poster_path": "/xf8PbyQcR5ucXErmZNzdKR0s8ya.jpg",
      "release_date": "2016-10-25",
      "title": "Doctor Strange",
      "video": false,
      "vote_average": 7.4,
      "vote_count": 16822
    },
    {
      "adult": false,
      "backdrop_path": "/gzhVcfC5j0sTnS4WJzBrCS0Vkr0.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 166424,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "Fantastic Four",
      "overview": "Empat pemuda luar berteleportasi ke alam semesta berbahaya, yang mengubah bentuk fisik mereka dengan cara yang mengejutkan. Hidup mereka berubah total, tim harus belajar memanfaatkan kemampuan baru mereka yang menakutkan dan bekerja sama untuk menyelamatkan Bumi dari mantan teman yang menjadi musuh.",
      "popularity": 46.762,
      "poster_path": "/oeMpEsjmiT9PEJbRM1Fm7TZ1dE0.jpg",
      "release_date": "2015-08-05",
      "title": "Fantastic Four",
      "video": false,
      "vote_average": 4.4,
      "vote_count": 4738
    },
    {
      "adult": false,
      "backdrop_path": "/wQNYzjQKSZZ1eDJ0w1O62HPFDfN.jpg",
      "genres": "Action, Adventure, Science Fiction",
      "id": 22059,
      "media_type": "movie",
      "original_language": "en",
      "original_title": "The Fantastic Four",
      "overview": "The Fantastic Four adalah film fitur anggaran rendah yang belum pernah dirilis yang diselesaikan pada tahun 1994. Dibuat untuk mengamankan hak cipta atas properti, produser tidak pernah bermaksud untuk merilisnya meskipun sutradara, aktor, dan peserta lain tidak diberitahu tentang fakta ini. Film ini diproduksi oleh spesialis anggaran rendah Roger Corman dan Bernd Eichinger (yang juga memproduksi film Fantastic Four lainnya pada tahun 2005).",
      "popularity": 8.605,
      "poster_path": "/xaUuroRciJeSAVnIvGu2c9bvkQd.jpg",
      "release_date": "1994-01-01",
      "title": "The Fantastic Four",
      "video": false,
      "vote_average": 4.5,
      "vote_count": 105
    },
   {
     "adult": false,
     "backdrop_path": "/5iidzov8DrsSyZdefeo7jBLDNUW.jpg",
     "genres": "Action, Adventure, Fantasy",
     "id": 297802,
     "media_type": "movie",
     "original_language": "en",
     "original_title": "Aquaman",
     "overview": "Dulunya rumah bagi peradaban paling maju di Bumi, Atlantis sekarang menjadi kerajaan bawah air yang diperintah oleh Raja Orm yang haus kekuasaan. Dengan pasukan besar yang dimilikinya, Orm berencana untuk menaklukkan orang-orang samudra yang tersisa dan kemudian dunia permukaan. Yang menghalangi jalannya adalah Arthur Curry, saudara setengah manusia Orm, saudara setengah Atlantis dan pewaris sejati takhta.",
     "popularity": 8.605,
     "poster_path": "/rNQompSTfAG5O2iXSH8Phay4L45.jpg",
     "release_date": "2018-12-07",
     "title": "Aquaman (2018)",
     "video": false,
     "vote_average": 6.9,
     "vote_count": 10374
   }
 ]
  }